{"author":"ppedrot","number":10,"diff_summary":[{"file":"mathcomp/ssreflect/plugin/trunk/ssreflect.ml4","status":"M","additions":47,"deletions":15}],"state":"closed","open_date":"2015-11-23T18:24:23Z","update_date":"2015-12-03T18:53:40Z","discussion":[{"author":"gares","date":"2015-11-23T18:58:16Z","comment":"Thanks for the patch!\nBut I guess I'd prefer a single function adapting the new API to the old one... most of the patch seems to repeat the very same pattern over and over.\n"},{"author":"ppedrot","date":"2015-11-24T00:15:31Z","comment":"Well, I think ssreflect would gain a lot by switching to the new (unfinished) API, as it would allow for a static expression of relative timing between evarmaps. The current patch is compatible with a gradual typing of extensibility constraints...\n"},{"author":"gares","date":"2015-11-24T07:36:31Z","comment":"Sorry but I'm not following.  I'm OK for the new API, but this can be done only when the API is final.  Your pull request seem to wrap the new API into a compatibility function, but that function is not defined, it is just inlined.  What do you mean by \"compatible with gradual...\"? An why this is not possible if one defines a wrapper once an forall?  Best.\n"},{"author":"ppedrot","date":"2015-11-24T08:30:40Z","comment":"I mean that under the assumption that in ssreflect you want to use the new API rather than just port the code to it (i.e. making explicit constraints in the type of ssreflect functions), this is going to require a non negligible amount of work. Therefore, you'll have to do it on several passes, and you'll end up needing several variants of the wrapper, according to the types of its arguments and returned value (depending of what part of the code around you upgraded). The advantage of the current patch is that you can remove the compatibility lines one by one on a per-use basis.\n"},{"author":"gares","date":"2015-12-03T18:53:50Z","comment":"merged\n"}],"review_discussion":[],"tags":[],"commits":[{"author":"ppedrot","committer":"ppedrot","hash":"986f3758249fd3d6ea6cf666b81aa7b89b6917f3","message":"Fix ML compilation w.r.t. trunk.","date":"2015-11-23T18:20:02Z"}]}