{"author":"JasonGross","number":174,"diff_summary":[{"file":"mathcomp/Makefile","status":"M","additions":3,"deletions":1}],"state":"closed","open_date":"2017-12-18T22:08:37Z","update_date":"2018-08-01T09:48:10Z","discussion":[{"author":"CohenCyril","date":"2018-01-26T16:57:00Z","comment":"This looks useful, but I am unable to understand the implications of this pull request. @gares can you give your opinion?"},{"author":"amahboubi","date":"2018-03-23T13:16:03Z","comment":"Hi @JasonGross, could you help us assessing this pull request? I not the most qualified dev on this kind of stuff, but  I just do not understand why you need this."},{"author":"JasonGross","date":"2018-03-24T18:52:39Z","comment":"In the present state of the repo, you do `OLD_MAKEFLAGS:=$(MAKEFLAGS)`, which gets evaluated once in the global context.  Apparently, `make` does not put jobserver flags (used for parallel make) in `MAKEFLAGS` in the global context, but only when you are executing a rule, and so when you pass the makeflags on to `MAKEFLAGS=\"$(OLD_MAKEFLAGS)\" $(MAKE) -f Makefile.coq`, you lose the parallel build.  This PR uses `OLD_MAKEFLAGS=` instead of `OLD_MAKEFLAGS:=`, which means that the body of `OLD_MAKEFLAGS` gets evaluated at use-site instead of at definition site, and so the jobserver flags, which only show up in `MAKEFLAGS` in the context of executing a rule, do get picked up appropriately."}],"review_discussion":[],"tags":[],"commits":[{"author":"JasonGross","committer":"JasonGross","hash":"bda1aa9d494e4c92374db32f47e456ff9cd35540","message":"Enable parallel build, fix #88\n\nApparently, the jobserver flags don't show up until we're actually\nexecuting a rule.  So rather than save the old flags, we instead record\nwhether or not we've seen -B before adding it (actually, whether we've\nseen -B or B, since it seems that make stores B rather than -B in\nMAKEFLAGS?), and then, later, we filter out B and -B only if we didn't\nsee them before we added them.","date":"2017-12-18T22:07:06Z"}]}