{"author":"ejgallego","number":79,"diff_summary":[{"file":"index.html","status":"M","additions":2,"deletions":1}],"state":"merged","open_date":"2016-11-04T17:47:28Z","update_date":"2016-11-05T09:16:01Z","discussion":[{"author":"gares","date":"2016-11-04T20:03:06Z","comment":"@maximedenes what was the magic trick to get coq-club indexed?\n"},{"author":"amahboubi","date":"2016-11-05T08:44:57Z","comment":"Ciao @gares , I opened a ticket for this 2 days ago. The IT guys did the same trick as for coq-club : let's wait for a couple of days to see if it works.\n"},{"author":"ejgallego","date":"2016-11-05T12:26:30Z","comment":"Indeed @gares that should be set, a direct link to the archives was missing for google to pick them up, as robots.txt still forbids accesing the mailing list information page.\n\nNow that I think of it, @amahboubi , it could make sense to request the INRIA ops to allow access to the info page too. Now if you google \"ssreflect mailing list\" you'll go directly to the archives.\n"},{"author":"ejgallego","date":"2016-11-05T12:27:55Z","comment":"@maximedenes the same applies to coq-club, if you google \"coq club mailing list\" you land into the archives.\n\n[Generally the whole Disallow: / of sympa's robots seems a bit strange IMVVHO]\n"},{"author":"amahboubi","date":"2016-11-15T11:21:40Z","comment":"@ejgallego : can you confirm that \"your\" google finds the archive with this query? I do not manage to reproduce this success...\n"},{"author":"ejgallego","date":"2016-11-15T14:15:43Z","comment":"@amahboubi indeed the list seems poorly indexed still, I was hoping that this trick would improve matters but so far it hasn't.\n\nCurrently I need to google for the title of the page, thus \"ssreflect discussion list\" ; what is weird is that discussions doesn't seem to be followed by google yet.\n"},{"author":"ejgallego","date":"2016-11-22T15:54:51Z","comment":"@amahboubi It seems that google has picked up with the archives and the situation has improved a bit, example: https://www.google.com/#q=ssreflect+tensor+product gets me to the right place now."},{"author":"amahboubi","date":"2016-11-23T10:21:46Z","comment":"Thanks for reporting @ejgallego. Actually I got a message yesterday  from  the Inria sysadmins  about this issue. May be they found the right incantation to be placed in robot.txt. I'll keep you posted here once I get feedback from them."},{"author":"amahboubi","date":"2016-11-23T10:44:18Z","comment":"Indeed, this issue seems to be solved. @maximedenes : they applied the same trick for coq-club :)."}],"review_discussion":[],"tags":[],"commits":[{"author":"ejgallego","committer":"ejgallego","hash":"9cefbb186d7f24c2a36145ac8d6cf2ba4e0ba54e","message":"Add direct link to the archives to help google indexing.\n\nThe information page is forbidden by INRIA robots so we may want to hint\ngoogle where the accessible archives are.","date":"2016-11-04T17:44:40Z"}]}