[{"author":"haansn08","number":4,"state":"open","open_date":"2023-03-15T16:52:05Z","update_date":"2023-04-11T09:23:31Z","discussion":[],"tags":[],"pull_requests":[]},{"author":"CohenCyril","number":3,"state":"closed","open_date":"2022-07-26T12:40:24Z","update_date":"2022-11-25T16:27:51Z","discussion":[{"author":"CohenCyril","date":"2022-11-25T09:42:20Z","comment":"I'm going to go ahead and merge"},{"author":"hivert","date":"2022-11-25T11:00:24Z","comment":"Dear @CohenCyril . A *big* thanks for the update. I'm quite away from Coq at the moment, but I should get back in a few month. I had a quick review on the change and everthing looks good. So please merge ! And thank you again !"}],"tags":[],"pull_requests":[]},{"author":"palmskog","number":2,"state":"open","open_date":"2021-11-05T08:45:38Z","update_date":"2021-11-10T18:30:00Z","discussion":[{"author":"hivert","date":"2021-11-10T17:57:02Z","comment":"Dear @palmskog,\r\n\r\nThis is a very good news. I'm using a very small part of ALEA, since I'm only dealing with discrete probabilities. However, together with Christine Paulin, we wrote some bindings between ALEA and mathcomp rationals which might by of general interest. I only maintained this part to have my code compile. It is probably very incomplete."},{"author":"palmskog","date":"2021-11-10T18:30:00Z","comment":"@hivert since ALEA is not a widely used package, I think it would be a reasonable idea to put the MathComp bindings directly into ALEA and have ALEA as a whole depend on MathComp.\r\n\r\nHowever, the tradeoff for you would be that you have to depend on the ALEA package/project in the code here. We have done a lot of work recently to have continuous integration (CI) work well with external packages via opam (and Nix), but it's still a bit of work.\r\n\r\nMaybe you would consider becoming a co-maintainer of the ALEA project in coq-community so you can make sure the MathComp bindings always work with Coq-Combi? If so, I can help set that up (and also help with CI here)."}],"tags":[],"pull_requests":[]},{"author":"CohenCyril","number":1,"state":"closed","open_date":"2018-08-31T17:42:45Z","update_date":"2018-09-10T13:45:36Z","discussion":[{"author":"hivert","date":"2018-09-02T17:15:52Z","comment":"Done (generalizing). Concerning #207. I knew you had something like that but didi't knew where. No I know. Thanks !"}],"tags":[],"pull_requests":[]}]